OdIfcFile.checkRepo(OdDAI.Repository!System.Runtime.CompilerServices.IsConst*)
\details
Checks if repository contains single model based on IFC schema.
\param repo [in] A raw pointer to the repository object to be attached to the file object.
\returns true if repository can be attached to OdIfcFile instance; otherwise returns false.